using Discord.WebSocket;

namespace AdeniumBot.Handlers
{
    public class ChampionCommandHandler
    {
        private readonly Random _random = new();

        private readonly string[] _champions =
        {
            "Аврора", "Азир", "Акали", "Акшан", "Алистар", "Амбесса", "Амуму", "Анивия", "Ари",
            "Атрокс", "Аурелион Сол", "Афелий", "Бард", "Бел’Вет", "Блицкранк", "Брайер", "Браум",
            "Брэнд", "Вай", "Варвик", "Варус", "Вейгар", "Вейн", "Векс", "Вел'Коз",
            "Виего", "Виктор", "Владимир", "Волибир", "Вуконг", "Галио", "Гангпланк", "Гарен",
            "Гвен", "Гекарим", "Гнар", "Гнар", "Грагас", "Грейвз", "Дариус", "Джакс",
            "Джарван IV", "Джейс", "Джин", "Джинкс", "Диана", "Доктор Мундо", "Дрейвен", "Ёне",
            "Жанна", "Зайра", "Зак", "Зед", "Зерат", "Зери", "Зиггс", "Зилеан",
            "Зои", "Иверн", "Иллаой", "Ирелия", "Йорик", "К'Санте", "Ка'Зикс", "Каин",
            "Кай'Са", "Калиста", "Камилла", "Карма", "Картус", "Кассадин", "Кассиопея", "Катарина",
            "Квинн", "Кейл", "Кейтлин", "Кеннен", "Киана", "Киндред", "Клед", "Ког'Мао",
            "Корки", "Ксин Жао", "Ле Блан", "Леона", "Ли Син", "Лиллия", "Лиссандра", "Лулу",
            "Люкс", "Люциан", "Мальзахар", "Мальфит", "Маокай", "Мастер Йи", "Милио", "Мисс Фортуна",
            "Моргана", "Мордекайзер", "Наафири", "Нами", "Насус", "Наутилус", "Нидали", "Нико",
            "Нила", "Ноктюрн", "Нуну", "Олаф", "Орианна", "Орн", "Пайк", "Пантеон",
            "Поппи", "Райз", "Рамбл", "Раммус", "Рек'Сай", "Релл", "Рената Гласк", "Ренгар",
            "Ренектон", "Ривен", "Рэйкан", "Сайлас", "Самира", "Свейн", "Седжуани", "Сенна",
            "Серафина", "Сетт", "Сивир", "Синджед", "Синдра", "Сион", "Скарнер", "Смолдер",
            "Сона", "Сорака", "Таам Кенч", "Талия", "Талон", "Тарик", "Твистед Фейд", "Твич",
            "Тимо", "Трандл", "Треш", "Триндамир", "Тристана", "Удир", "Ургот", "Фиддлстикс", "Физз",
            "Фиора", "Хвэй", "Хеймердингер", "Чо'Гат", "Шако", "Шая", "Шен", "Шивана",
            "Эвелинн", "Эзреаль", "Экко", "Элиза", "Энни", "Эш", "Юми", "Ясуо"
        };


        public async Task OnSlashCommandAsync(SocketSlashCommand command)
        {
            if (!string.Equals(command.Data.Name, "champion", StringComparison.OrdinalIgnoreCase))
                return;

            var randomChampion = _champions[_random.Next(_champions.Length)];

            await command.RespondAsync(
                $"🎲 Тебе выпал чемпион: **{randomChampion}**!",
                ephemeral: false
            );
        }
    }
}